# Taps
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "nonchalant/appicon"

# Install ZSH
brew 'zsh'                                  # shell alternative to bash
brew 'zsh-autosuggestions'                  # zsh plugin to get suggestions while typing commands
brew 'zsh-completions'                      # zsh plugin to simplify commands completion
brew 'zsh-history-substring-search'         # zsh plugin to navigate history easier
brew 'zsh-syntax-highlighting'              # zsh plugin


# Improve BASH as Backup
brew "bash"                 # Latest Bash Version (macOS Version is always outdated)
brew "bash-completion"

# System Improvements
brew "coreutils"
brew "findutils"
brew "git"
brew "gnupg"
brew "gnupg2"
brew "grep"
brew "jenv"
brew "mackup"
brew "mas"
brew "node"
brew "openssl"
brew "python3"
brew "wget"

# Fun
brew "cowsay"
brew "fortune"

# Photography Tools
brew "exiftool"

# Apps
cask "1password"
cask "aerial"
cask "appcleaner"
cask "bartender"
cask "charles"
cask "controlplane"
cask "forklift"
cask "franz"
cask "google-chrome"
cask "istat-menus"
cask "java8"
cask "java"
cask "microsoft-office"
cask "paw"
cask "sublime-text"
cask "teamviewer"
cask "vlc"



# Quicklook Plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklook-csv"

# Fonts
cask "font-fira-code"

# Install Mac App Store 
mas "Bear", id: 1091189122
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Keynote", id: 409183694

## Additional

cask "tunnelblick"
cask "flycut"
cask "owncloud"
cask "atom"
cask "caffeine"
cask "dash"
cask "daisydisk"
cask "hipchat"
cask "gpg-suite"
cask "iterm2"
cask "jxplorer"
cask "mysqlworkbench"
cask "p4v"
cask "phpstorm"
cask "sequel-pro"
cask "slack"
cask "sourcetree"
cask "steam"
cask "telegram"
cask "teamviewer"
cask "thunderbird"
cask "go2shell"
cash "docker"

mas "LanScan", id: 472226235
mas "DaisyDisk", id: 411643860
mas "Carcassonne" id: 901869346